RSN/src/InformationRegisters/ЗаявкиНаСогласовании/ЗаявкиНаСогласовании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗаявкиНаСогласовании</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Состояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Информация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Письмо</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
    </type>
  </attributes>
  <attributes>
    <name>Гуид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>CatalogRef.ЗаявкиНаПредоставлениеДоступа</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/InformationRegisters/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатусыЗаявок</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыЗаявок</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Заявка</name>
    <type>
      <types>CatalogRef.ЗаявкиНаПредоставлениеДоступа</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RSN/src/Enums/СтатусыЗаявок/СтатусыЗаявок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявок</name>
  <enumValues>
    <name>Создано</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ВТесте</name>
  </enumValues>
  <enumValues>
    <name>НаПроверке</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтзыва</name>
  </enumValues>
  <enumValues>
    <name>Завершено</name>
  </enumValues>
  <enumValues>
    <name>НаПаузе</name>
  </enumValues>
  <enumValues>
    <name>Отозвано</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеУточнений</name>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
  </enumValues>
  <enumValues>
    <name>Согласовано</name>
  </enumValues>
  <enumValues>
    <name>ОтказаноВСогласовании</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаВыполнения</name>
  </enumValues>
</mdclass:Enum>

RSN/src/Documents/ЭлектронноеПисьмоИсходящее/ЭлектронноеПисьмоИсходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭлектронноеПисьмоИсходящее</name>
  <basedOn>Document.Встреча</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.ЗапланированноеВзаимодействие</basedOn>
  <basedOn>Document.СообщениеSMS</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийЗаголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНаСервере</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщенияОтправкаIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторыОснований</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительПредставление</name>
    <comment>Текстовое описание отправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейКопий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СписокПолучателейСкрытыхКопий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусПисьма</name>
    <type>
      <types>EnumRef.СтатусыИсходящегоЭлектронногоПисьма</types>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимодействиеОснование</name>
    <type>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.Встреча</types>
      <types>DocumentRef.СообщениеSMS</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьТелоИсходногоПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьТелоИсходногоПисьма</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПослеОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаКогдаОтправить</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальностиОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИдентификаторСообщенияОтправкаIMAP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСумма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиСкрытыхКопий</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контакт</name>
      <type>
        <types>DefinedType.КонтактВзаимодействия</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НепринятыеВложения</name>
    <attributes>
      <name>ИмяВложение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПисьмаВложения</name>
    <attributes>
      <name>Письмо</name>
      <type>
        <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
        <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомерВоВложениях</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

RSN/src/CommonModules/МетодыРегламентныеЗадания/Module.bsl
Процедура ОбработкаПисем() Экспорт
	ТЗ = РегистрыСведений.ЗаявкиНаСогласовании.ПолучитьЗаявкиНаСогласовании();
	Если ТЗ.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявкиНаСогласовании.Заявка КАК Заявка,
	               |	ЗаявкиНаСогласовании.Письмо КАК Письмо,
	               |	""%"" + ЗаявкиНаСогласовании.Гуид + ""%"" КАК Гуид
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	&ТЗ КАК ЗаявкиНаСогласовании
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Заявка КАК Заявка,
	               |	ЭлектронноеПисьмоИсходящее.Тема КАК Тема,
	               |	ЭлектронноеПисьмоИсходящее.Текст КАК Текст,
	               |	ЭлектронноеПисьмоИсходящее.ТекстHTML КАК ТекстHTML,
	               |	ЭлектронноеПисьмоИсходящее.ТипТекста КАК ТипТекста,
	               |	ЭлектронноеПисьмоИсходящее.Ссылка КАК ВхПисьмо,
	               |	0 КАК Вид
	               |ПОМЕСТИТЬ Сбор
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
	               |		ПО ВТ.Письмо = ЭлектронноеПисьмоИсходящее.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ.Заявка,
	               |	ЭлектронноеПисьмоИсходящее.Тема,
	               |	ЭлектронноеПисьмоИсходящее.Текст,
	               |	ЭлектронноеПисьмоИсходящее.ТекстHTML,
	               |	ЭлектронноеПисьмоИсходящее.ТипТекста,
	               |	ЭлектронноеПисьмоИсходящее.Ссылка,
	               |	1
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЭлектронноеПисьмоИсходящее КАК ЭлектронноеПисьмоИсходящее
	               |		ПО (ЭлектронноеПисьмоИсходящее.Тема ПОДОБНО ВТ.Гуид
	               |				ИЛИ ЭлектронноеПисьмоИсходящее.Текст ПОДОБНО ВТ.Гуид
	               |				ИЛИ ЭлектронноеПисьмоИсходящее.ТекстHTML ПОДОБНО ВТ.Гуид)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Сбор.Заявка КАК Заявка,
	               |	Сбор.Тема КАК Тема,
	               |	Сбор.Текст КАК Текст,
	               |	Сбор.ТекстHTML КАК ТекстHTML,
	               |	Сбор.ТипТекста КАК ТипТекста,
	               |	Сбор.ВхПисьмо КАК Письмо,
	               |	Сбор.Вид КАК Вид
	               |ИЗ
	               |	Сбор КАК Сбор
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВхПисьмо УБЫВ
	               |ИТОГИ ПО
	               |	Заявка";  
	Запрос.УстановитьПараметр("ТЗ", ТЗ);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Заявки = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Заявки.Следующий() Цикл 
		Ответы = Заявки.Выбрать(); 
		//Найдено = Ложь;
		//Согласовано = Неопределено;  
		Проверка = Новый Структура("Найдено, Согласовано", Ложь, Ложь); 
		Пока Ответы.Следующий() Цикл 
			Если Ответы.Вид = 0 Тогда 
				
				Если ЗначениеЗаполнено(Ответы.Текст) = Ложь Тогда 
					Продолжить;
				КонецЕсли;          
				НТекст 	= НРег(Ответы.Текст);
				Позиция = СтрНайти(НТекст, "согласован");
				Если не ЗначениеЗаполнено(Позиция) Тогда 
					Продолжить;
				КонецЕсли;
				Проверка.Согласовано = Истина;
				Если Позиция > 2 Тогда 
					До 		= Лев(НТекст,Позиция);
					Позиция = СтрНайти(До, "не");
					Если ЗначениеЗаполнено(Позиция) Тогда 
						Проверка.Согласовано = Ложь;
					КонецЕсли;
				КонецЕсли;
				Проверка.Найдено = Истина;
				Прервать; 
				
			ИначеЕсли Ответы.Вид = 1 Тогда 
				Проверка = ПроверитьСогласовано(Ответы.Тема);
				Если Проверка.Найдено = Истина Тогда           
					Прервать;
				КонецЕсли;
				
				Если Ответы.ТипТекста = ПредопределенноеЗначение("Перечисление.ТипыТекстовЭлектронныхПисем.ПростойТекст") Тогда 
					Проверка = ПроверитьСогласовано(Ответы.Текст);
				Иначе 
					Проверка = ПроверитьСогласовано(Ответы.ТекстHTML);
				КонецЕсли;
				
				Если Проверка.Найдено = Истина Тогда           
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Проверка.Найдено Тогда 
			НачатьТранзакцию(); 
			НовыйСтатус = ?(Проверка.Согласовано,ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Согласовано"),ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ОтказаноВСогласовании"));
			Результат 	= РегистрыСведений.СтатусыЗаявок.УстановитьСтатус(Ответы.Заявка,НовыйСтатус);
			Если Результат.ЕстьОшибка Тогда 
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			
			Результат = РегистрыСведений.ЗаявкиНаСогласовании.ЗавершитьСогласование(Новый Структура("Заявка,Письмо",Ответы.Заявка,Ответы.Письмо));
			Если Результат.ЕстьОшибка Тогда 
				ОтменитьТранзакцию();
				Возврат;
			КонецЕсли;
			ЗафиксироватьТранзакцию();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры  

Функция ПроверитьСогласовано(Текст)  
	Ответ = Новый Структура("Найдено, Согласовано", Ложь, Ложь);
	Если СтрНайти(Текст, "[APPROVED]") Тогда 
		Ответ.Найдено = Истина;
		Ответ.Согласовано = Истина;
	ИначеЕсли СтрНайти(Текст, "[REJECTED]") Тогда 
		Ответ.Найдено = Истина;
		//Согласовано = Ложь;
	КонецЕсли; 
	Возврат Ответ;
КонецФункции


Процедура ВыдатьПраваПоЗаявкам() Экспорт   
	//ТД = ТекущаяДата();
	
	Запрос = Новый Запрос;      
	//Запрос.Текст = "ВЫБРАТЬ
	//               |	СтатусыЗаявокСрезПоследних.Заявка,
	//               |	1
	//               |ИЗ
	//               |	РегистрСведений.СтатусыЗаявок.СрезПоследних КАК СтатусыЗаявокСрезПоследних
	//               |ГДЕ
	//               |	СтатусыЗаявокСрезПоследних.Статус = &СтатусВРаботе
	//               |	И РАЗНОСТЬДАТ(СтатусыЗаявокСрезПоследних.Период, &ТД, МИНУТА) >= 10";  
	//
	//Запрос.УстановитьПараметр("СтатусВРаботе", ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.ВРаботе"));
	//
	//Результат = Запрос.Выполнить().Выгрузить();
	//Если Результат.Количество() = 0 = Ложь Тогда 
	//КонецЕсли;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СтатусыЗаявокСрезПоследних.Заявка КАК Заявка
	               |ИЗ
	               |	РегистрСведений.СтатусыЗаявок.СрезПоследних КАК СтатусыЗаявокСрезПоследних
	               |ГДЕ
	               |	СтатусыЗаявокСрезПоследних.Статус = &СтатусСогласовано";
	Запрос.УстановитьПараметр("СтатусСогласовано", ПредопределенноеЗначение("Перечисление.СтатусыЗаявок.Согласовано"));
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл  
		УправлениеСтатусами.ОтработатьСогласовано(Выборка.Заявка);
	КонецЦикла;
	
	
КонецПроцедуры
